fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ВКМ_НачисленияЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачисленияЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_Начисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_УдержанияСотрудников</registerRecords>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Начисления/ВКМ_Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикРаботы</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикРаботы.Resource.КоличествоДней</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_УдержанияСотрудников/ВКМ_УдержанияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_УдержанияСотрудников</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикРаботы/ВКМ_ГрафикРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикРаботы</name>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_НачисленияПремий/ВКМ_НачисленияПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_НачисленияПремий</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>ПроцентЗаРаботы</name>
      <description>Процент за выполненные работы</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Оплата отпуска</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_Начисления.Очистить();
	Движения.ВКМ_УдержанияСотрудников.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	
	Движения.ВКМ_Начисления.Записывать = Истина;
	Движения.ВКМ_УдержанияСотрудников.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	НачалоМесяцаНачисления = НачалоМесяца(МесяцНачисления);
	ОкончаниеМесяцаНачисления = КонецМесяца(МесяцНачисления);
	СтавкаНДФЛ = 13;
	
	НачалоБазовогоПериода = ДобавитьМесяц(НачалоМесяцаНачисления, -12);
	ОкончаниеБазовогоПериода = ДобавитьМесяц(ОкончаниеМесяцаНачисления, -1);
	
	КартаГрафикаРаботы = ЗагрузитьГрафикРаботы();
	
	РабочихДнейВМесяце = РабочихДнейПоГрафику(КартаГрафикаРаботы,
		НачалоМесяцаНачисления, ОкончаниеМесяцаНачисления);
	РабочихДнейВБазовомПериоде = РабочихДнейПоГрафику(КартаГрафикаРаботы,
		НачалоБазовогоПериода, ОкончаниеБазовогоПериода);
	
	УсловияОплаты = УсловияОплатыСотрудников(НачалоМесяцаНачисления);
	СуммыЗаВыполненныеРаботы = СуммыЗаВыполненныеРаботы(НачалоМесяцаНачисления, ОкончаниеМесяцаНачисления);
	СуммыНачисленийБазовогоПериода = СуммыНачисленийЗаПериод(НачалоБазовогоПериода, ОкончаниеБазовогоПериода);
	ОтпускаПоСотрудникам = ОтпускаСотрудников(Год(НачалоМесяцаНачисления));
	
	Для Каждого СтрокаСотрудники Из Сотрудники Цикл
		
		Сотрудник = СтрокаСотрудники.Сотрудник;
		
		Оклад = 0;
		ДанныеУсловийОплаты = УсловияОплаты[Сотрудник];
		Если ДанныеУсловийОплаты <> Неопределено Тогда
			Оклад = ДанныеУсловийОплаты.Оклад;
		КонецЕсли;
		
		// Отпуск, приходящийся на месяц начисления.
		КалендарныхДнейОтпуска = 0;
		РабочихДнейОтпуска = 0;
		НачалоОтпускаВМесяце = ОкончаниеМесяцаНачисления;
		ОкончаниеОтпускаВМесяце = НачалоМесяцаНачисления;
		ДанныеОтпусков = ОтпускаПоСотрудникам[Сотрудник];
		Если ДанныеОтпусков <> Неопределено Тогда
			Для Каждого ПериодОтпуска Из ДанныеОтпусков.Периоды Цикл
				
				НачалоПересечения = Макс(ПериодОтпуска.ДатаНачала, НачалоМесяцаНачисления);
				ОкончаниеПересечения = Мин(ПериодОтпуска.ДатаОкончания, ОкончаниеМесяцаНачисления);
				Если НачалоПересечения > ОкончаниеПересечения Тогда
					Продолжить;
				КонецЕсли;
				
				КалендарныхДнейОтпуска = КалендарныхДнейОтпуска
					+ КоличествоКалендарныхДней(НачалоПересечения, ОкончаниеПересечения);
				РабочихДнейОтпуска = РабочихДнейОтпуска
					+ РабочихДнейПоГрафику(КартаГрафикаРаботы, НачалоПересечения, ОкончаниеПересечения);
				
				НачалоОтпускаВМесяце = Мин(НачалоОтпускаВМесяце, НачалоПересечения);
				ОкончаниеОтпускаВМесяце = Макс(ОкончаниеОтпускаВМесяце, ОкончаниеПересечения);
				
			КонецЦикла;
		КонецЕсли;
		
		// В период отпуска оклад не начисляется - начисляем пропорционально
		// отработанным рабочим дням месяца.
		ОтработанныхДней = РабочихДнейВМесяце - РабочихДнейОтпуска;
		СуммаОклада = 0;
		Если РабочихДнейВМесяце > 0 И ОтработанныхДней > 0 Тогда
			СуммаОклада = Окр(Оклад / РабочихДнейВМесяце * ОтработанныхДней, 2);
		КонецЕсли;
		
		// Процент за выполненные сотрудником работы.
		СуммаПоПроценту = 0;
		СуммаЗаРаботы = СуммыЗаВыполненныеРаботы[Сотрудник];
		Если СуммаЗаРаботы <> Неопределено Тогда
			СуммаПоПроценту = СуммаЗаРаботы;
		КонецЕсли;
		
		// Отпускные: среднедневной заработок за последние 12 месяцев,
		// умноженный на количество календарных дней отпуска.
		СуммаОтпускных = 0;
		Если КалендарныхДнейОтпуска > 0 И РабочихДнейВБазовомПериоде > 0 Тогда
			СуммаБазы = 0;
			ЗначениеБазы = СуммыНачисленийБазовогоПериода[Сотрудник];
			Если ЗначениеБазы <> Неопределено Тогда
				СуммаБазы = ЗначениеБазы;
			КонецЕсли;
			СреднедневнойЗаработок = СуммаБазы / РабочихДнейВБазовомПериоде;
			СуммаОтпускных = Окр(СреднедневнойЗаработок * КалендарныхДнейОтпуска, 2);
		КонецЕсли;
		
		СуммаНачислено = СуммаОклада + СуммаПоПроценту + СуммаОтпускных;
		СуммаНДФЛ = Окр(СуммаНачислено * СтавкаНДФЛ / 100, 2);
		
		// Движения по регистру расчета основных начислений.
		ДобавитьДвижениеНачисления(Сотрудник, НачалоМесяцаНачисления, ОкончаниеМесяцаНачисления,
			ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад, СуммаОклада);
		ДобавитьДвижениеНачисления(Сотрудник, НачалоМесяцаНачисления, ОкончаниеМесяцаНачисления,
			ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентЗаРаботы, СуммаПоПроценту);
		ДобавитьДвижениеНачисления(Сотрудник, НачалоОтпускаВМесяце, ОкончаниеОтпускаВМесяце,
			ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск, СуммаОтпускных);
		
		// Удержание НДФЛ.
		Если СуммаНДФЛ <> 0 Тогда
			Движение = Движения.ВКМ_УдержанияСотрудников.Добавить();
			Движение.ПериодРегистрации = НачалоМесяцаНачисления;
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Движение.Сотрудник = Сотрудник;
			Движение.Результат = СуммаНДФЛ;
		КонецЕсли;
		
		// Задолженность перед сотрудником.
		Если СуммаНачислено <> 0 Тогда
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сотрудник = Сотрудник;
			Движение.Сумма = СуммаНачислено - СуммаНДФЛ;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет движение по регистру расчета ВКМ_Начисления.
//
// Параметры:
//  Сотрудник - СправочникСсылка.Пользователи - сотрудник.
//  НачалоПериодаДействия - Дата - начало периода действия.
//  ОкончаниеПериодаДействия - Дата - окончание периода действия.
//  ВидРасчета - ПланВидовРасчетаСсылка - вид расчета.
//  Сумма - Число - результат расчета.
//
Процедура ДобавитьДвижениеНачисления(Сотрудник, НачалоПериодаДействия, ОкончаниеПериодаДействия,
	ВидРасчета, Сумма)
	
	Если Сумма = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ВКМ_Начисления.Добавить();
	Движение.ПериодРегистрации = НачалоМесяца(МесяцНачисления);
	Движение.ПериодДействияНачало = НачалоПериодаДействия;
	Движение.ПериодДействияКонец = ОкончаниеПериодаДействия;
	Движение.ВидРасчета = ВидРасчета;
	Движение.Сотрудник = Сотрудник;
	Движение.Результат = Сумма;
	
КонецПроцедуры

// Загружает график работы в виде соответствия: дата - количество рабочих дней.
//
// Возвращаемое значение:
//  Соответствие Из Дата, Число - данные графика работы.
//
Функция ЗагрузитьГрафикРаботы()
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикРаботы.Дата КАК Дата,
		|	ГрафикРаботы.КоличествоДней КАК КоличествоДней
		|ИЗ
		|	РегистрСведений.ВКМ_ГрафикРаботы КАК ГрафикРаботы";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Дата, Выборка.КоличествоДней);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает количество рабочих дней за период по данным графика работы.
//
// Параметры:
//  КартаГрафика - Соответствие Из Дата, Число - данные графика работы.
//  НачалоПериода - Дата - начало периода.
//  ОкончаниеПериода - Дата - окончание периода.
//
// Возвращаемое значение:
//  Число - количество рабочих дней.
//
Функция РабочихДнейПоГрафику(КартаГрафика, НачалоПериода, ОкончаниеПериода)
	
	Количество = 0;
	ТекущаяДата = НачалоДня(НачалоПериода);
	ПоследняяДата = НачалоДня(ОкончаниеПериода);
	Пока ТекущаяДата <= ПоследняяДата Цикл
		
		Значение = КартаГрафика[ТекущаяДата];
		Если Значение <> Неопределено Тогда
			Количество = Количество + Значение;
		КонецЕсли;
		
		ТекущаяДата = ТекущаяДата + 86400;
		
	КонецЦикла;
	
	Возврат Количество;
	
КонецФункции

// Возвращает количество календарных дней в периоде включительно.
//
// Параметры:
//  НачалоПериода - Дата - начало периода.
//  ОкончаниеПериода - Дата - окончание периода.
//
// Возвращаемое значение:
//  Число - количество календарных дней.
//
Функция КоличествоКалендарныхДней(НачалоПериода, ОкончаниеПериода)
	
	Количество = 0;
	ТекущаяДата = НачалоДня(НачалоПериода);
	ПоследняяДата = НачалоДня(ОкончаниеПериода);
	Пока ТекущаяДата <= ПоследняяДата Цикл
		Количество = Количество + 1;
		ТекущаяДата = ТекущаяДата + 86400;
	КонецЦикла;
	
	Возврат Количество;
	
КонецФункции

// Возвращает условия оплаты сотрудников на дату.
//
// Параметры:
//  ДатаУсловий - Дата - дата, на которую определяются условия оплаты.
//
// Возвращаемое значение:
//  Соответствие Из СправочникСсылка.Пользователи, Структура - ключ - сотрудник,
//  значение - структура с полями Оклад, ПроцентОтРабот.
//
Функция УсловияОплатыСотрудников(ДатаУсловий)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УсловияОплатыСрезПоследних.Сотрудник КАК Сотрудник,
		|	УсловияОплатыСрезПоследних.Оклад КАК Оклад,
		|	УсловияОплатыСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, ) КАК УсловияОплатыСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ДатаУсловий);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Данные = Новый Структура("Оклад, ПроцентОтРабот", Выборка.Оклад, Выборка.ПроцентОтРабот);
		Результат.Вставить(Выборка.Сотрудник, Данные);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает суммы к оплате сотрудникам за выполненные работы.
//
// Параметры:
//  НачалоПериода - Дата - начало периода.
//  ОкончаниеПериода - Дата - окончание периода.
//
// Возвращаемое значение:
//  Соответствие Из СправочникСсылка.Пользователи, Число - ключ - сотрудник,
//  значение - сумма к оплате.
//
Функция СуммыЗаВыполненныеРаботы(НачалоПериода, ОкончаниеПериода)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыполненныеРаботы.Сотрудник КАК Сотрудник,
		|	СУММА(ВыполненныеРаботы.СуммаКОплате) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы КАК ВыполненныеРаботы
		|ГДЕ
		|	ВыполненныеРаботы.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|СГРУППИРОВАТЬ ПО
		|	ВыполненныеРаботы.Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Сотрудник, Выборка.Сумма);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает суммы начислений сотрудникам за период (основные и дополнительные).
//
// Параметры:
//  НачалоПериода - Дата - начало периода.
//  ОкончаниеПериода - Дата - окончание периода.
//
// Возвращаемое значение:
//  Соответствие Из СправочникСсылка.Пользователи, Число - ключ - сотрудник,
//  значение - сумма начислений.
//
Функция СуммыНачисленийЗаПериод(НачалоПериода, ОкончаниеПериода)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияПериода.Сотрудник КАК Сотрудник,
		|	СУММА(НачисленияПериода.Результат) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		Начисления.Сотрудник КАК Сотрудник,
		|		Начисления.Результат КАК Результат
		|	ИЗ
		|		РегистрРасчета.ВКМ_Начисления КАК Начисления
		|	ГДЕ
		|		Начисления.ПериодРегистрации МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		НачисленияПремий.Сотрудник,
		|		НачисленияПремий.Результат
		|	ИЗ
		|		РегистрРасчета.ВКМ_НачисленияПремий КАК НачисленияПремий
		|	ГДЕ
		|		НачисленияПремий.ПериодРегистрации МЕЖДУ &НачалоПериода И &ОкончаниеПериода) КАК НачисленияПериода
		|СГРУППИРОВАТЬ ПО
		|	НачисленияПериода.Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Сотрудник, Выборка.Сумма);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает запланированные отпуска сотрудников за год.
//
// Параметры:
//  ГодОтпусков - Число - год, за который отбираются отпуска.
//
// Возвращаемое значение:
//  Соответствие Из СправочникСсылка.Пользователи, Структура - ключ - сотрудник,
//  значение - структура с полем Периоды (массив структур с полями ДатаНачала, ДатаОкончания).
//
Функция ОтпускаСотрудников(ГодОтпусков)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикОтпусков.ОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ГрафикОтпусков.ОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ГрафикОтпусков.ОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ГрафикОтпусков
		|ГДЕ
		|	ГрафикОтпусков.Год = &Год
		|	И ГрафикОтпусков.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Год", ГодОтпусков);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДанныеОтпусков = Результат[Выборка.Сотрудник];
		Если ДанныеОтпусков = Неопределено Тогда
			ДанныеОтпусков = Новый Структура("Периоды", Новый Массив);
			Результат.Вставить(Выборка.Сотрудник, ДанныеОтпусков);
		КонецЕсли;
		
		ПериодОтпуска = Новый Структура("ДатаНачала, ДатаОкончания", Выборка.ДатаНачала, Выборка.ДатаОкончания);
		ДанныеОтпусков.Периоды.Добавить(ПериодОтпуска);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Заполняет табличную часть Сотрудники всеми действующими пользователями.
//
Процедура ЗаполнитьСотрудников() Экспорт
	
	Сотрудники.Очистить();
	
	Выборка = Справочники.Пользователи.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Сотрудники.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
